# ShowHiddenLines Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ViewDisplayModel..::..ShowHiddenLines Property
ViewDisplayModel Class See Also
---
True to enable hidden lines. False to disable showing them.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2015
# Syntax
C#
---
```text
public ShowHiddenLinesValues ShowHiddenLines { get; set; }
```

Visual Basic
---
```text
Public Property ShowHiddenLines As ShowHiddenLinesValues
	Get
	Set
```

Visual C++
---
```text
public:
property ShowHiddenLinesValues ShowHiddenLines {
	ShowHiddenLinesValues get ();
	void set (ShowHiddenLinesValues value);
}
```

# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentOutOfRangeException | When setting this property: A value passed for an enumeration argument is not a member of that enumeration |

# See Also
ViewDisplayModel Class
Autodesk.Revit.DB Namespace